In [ ]:
phrase = "I'm Emma" # String
print(phrase)

In [ ]:
x = 5 # Integer
y = 10 
z = x + y #plus symbol
print(z)
z = y / x #divide
print(z) # Float
print(type(z))

j=type(z)
print(j)

In [ ]:
x = 5
y = 7
print(x*y)

In [ ]:
r = 2
pi = 3.14
square = r**2
area = pi * (r**2)
print(area)

In [ ]:
name ="Emma"
hobby = "running"
long_string = "My name is " + name + " and my hobby is " + hobby
#print(long_string)

phrase = f"My name is {name} and my hobby is {hobby}"
print(phrase)

In [ ]:
name = "Emma"
role = "Performance Project Officer"
phrase = f"My name is {name} and my job title is {role}"
print(phrase)

In [35]:
print(len(phrase))
string_slice = phrase[3:15]
print(string_slice)

filename = "here_is_a_file.csv"
filename = filename[:-4]
print(filename)

NameError: name 'phrase' is not defined

In [ ]:
slice_this_phrase = 'dog cat racoon'
dog = slice_this_phrase[0:3]
print(dog)
cat = slice_this_phrase[4:7]
print(cat)
racoon = slice_this_phrase[-6:]
print(racoon)
print(f"{dog} {cat} {racoon}")

In [ ]:
list_1 = [1,2,3,x,y]
print(list_1)

In [ ]:
favourite_colour = "teal"
colours_list = ["red", "blue", "green"]
colours_list.append(favourite_colour)
print(f"My colours are: {colours_list}")

In [17]:
food_list = ["potato", "pasta", "rice", "meat"]
favourite_food = "cheese"
print (food_list)
food_list.append(favourite_food)   
print(food_list)

['potato', 'pasta', 'rice', 'meat']
['potato', 'pasta', 'rice', 'meat', 'cheese']

In [ ]:
food_list = ["potato", "pasta", "rice", "meat"]
new_food_list = ["apple", "banana","grape"]
print(new_food_list)
#food_list.append(new_food_list)
#food_list.extend(new_food_list)
print(food_list)

In [3]:
numbers_list = [2,3,4,5,1,6]
numbers_list.sort()

numbers_list = [2,3,4,5,1,6]
numbers_list.sort(reverse=True)
print(numbers_list)

[6, 5, 4, 3, 2, 1]

In [4]:
food_list = ["potato", "pasta", "Apples", "meat"]
food_list.sort()
print(food_list)

['Apples', 'meat', 'pasta', 'potato']

In [ ]:
favourite_colours_dict = {'will':'purple',
                     'scout':['yellow', 'red'],
                     'crash':23,
                     'Naomi':{'Monday':'purple',
                               'EOD':'Yellow'}}
print(favourite_colours_dict)
print(favourite_colours_dict['Naomi'])
print(favourite_colours_dict.keys())
print(favourite_colours_dict.values())
print(favourite_colours_dict.items())

In [ ]:
restaurant_dict = {'Chippy':'chips',
                     'Chinese':['rice', 'sweet & sour'],
                     'Indian':{'curry':'naan'}}
print(restaurant_dict)
print(restaurant_dict['Indian'])
print(restaurant_dict.keys())
print(restaurant_dict.values())
print(restaurant_dict.items())

In [ ]:
favourite_colours_dict = {'will':'purple',
                     'scout':['yellow', 'red'],
                     'crash':23,
                     'Naomi':'Orange'}
favourite_colours_dict['Annie']='Blue'
favourite_colours_dict['Naomi'] = 'Blue'
favourite_colours_dict['Andy'] = 'Blue'
print(favourite_colours_dict)
print('Andy' in favourite_colours_dict)

In [ ]:
job_dict = {'Emma':'Performance Officer',
            'Will':'Instructing',
            'Emily':'Perfommance Anylist',
            'Jon': 'Performance M',
            'Emma': 'Performance O',
            'Paul M':'Perf O',
            'Michael M': 'Regional',
            'Michael C': 'Anylist',
            'Paul D': 'Senior PM',
            'Nazahah': 'Analyst'
            }
names = list(job_dict.keys())
print(names)
for key,val in job_dict.items():
    print(f"My name is {key}, my job is {val}")

In [31]:
#Assignment 1.1
maths_dict = {}  #initialise a blank dictionary

x=7
y=5
add_var = (x+y)
sub_var = (x-y)
squared_var1 = (x**2)
squared_var2 = (y**2)
power_var = (pow(x,y))

maths_dict["Sum"] = add_var
maths_dict["Subtract"] = sub_var
maths_dict["Square x"] = squared_var1
maths_dict["Square y"] = squared_var2
maths_dict["Power"] = power_var

print(maths_dict)

{'Sum': 12, 'Subtract': 2, 'Square x': 49, 'Square y': 25, 'Power': 16807}

In [4]:
#Assignment 1.2
ccard = "4444444444444444"
print(ccard)
last4 = ccard[-4:]
print(last4)
len(ccard)
anon = "x"
non_anon = (len(ccard)-4)
print(non_anon)

print(anon * non_anon + last4)
len((anon * non_anon + last4))

4444444444444444
4444
12
xxxxxxxxxxxx4444

16

In [2]:
import pandas as pd

d = {"here's a column":['Val 1', 'Val 2', 'Val 3'],
     "here's another":['4, 5, 6'],
     "and another":['foo', 'bar', 'baz']}

print(d)

{"here's a column": ['Val 1', 'Val 2', 'Val 3'], "here's another": ['4, 5, 6'], 'and another': ['foo', 'bar', 'baz']}

In [77]:
import pandas as pd

dict_1 = {"heres's a column": ["val 1", "val 2", "val 3"],
         "col 2": [4,5,6],
          "col z": ["foo", "bar", "baz"] }

df_1 = pd.DataFrame(dict_1)
df_1

df_2 = pd.DataFrame([
    {'letter':'A',
     'word':'Foo',
     'number':1},
     {'letter':'b',
     'word':'Bar',
     'number':2},
     {'letter':'C',
     'word':'Baz',
     'number':3},
])

print(df_2)

  letter word  number
0      A  Foo       1
1      b  Bar       2
2      C  Baz       3

In [118]:
import pandas as pd

company = ([
{'Name': 'John Smith',
 'Job Title': 'Reception',
 'Salary': '10000'},
 {'Name': 'Jane Doe',
 'Job Title': 'Administration',
 'Salary': '12000'},
 {'Name': 'Mike Mann',
 'Job Title': 'Manager',
 'Salary': '15000'},
 {'Name': 'Mandy Mann',
 'Job Title': 'Director',
 'Salary': '20000'},
{'Name': 'Marge Mann',
 'Job Title': 'Director',
 'Salary': '20000'}
])

company_df = pd.DataFrame(company)

print(company_df)
company_df

         Name       Job Title Salary
0  John Smith       Reception  10000
1    Jane Doe  Administration  12000
2   Mike Mann         Manager  15000
3  Mandy Mann        Director  20000
4  Marge Mann        Director  20000

         Name       Job Title Salary
0  John Smith       Reception  10000
1    Jane Doe  Administration  12000
2   Mike Mann         Manager  15000
3  Mandy Mann        Director  20000
4  Marge Mann        Director  20000

In [119]:
#print(company_df.info())
#print(company_df.dtypes)
#print(company_df.head(1))
#print(company_df.tail(1))

company_df['Salary'] = company_df['Salary'].astype('int')
company_df.dtypes

Name         object
Job Title    object
Salary        int64
dtype: object

In [120]:
#print(company_df['Salary'].sum())

# company_salary_tot = company_df['Salary'].sum()
# print(company_salary_tot)

# company_salary_mean = company_df['Salary'].mean()
# print(company_salary_mean)

# company_salary_cumsum = company_df['Salary'].cumsum()
# print(company_salary_cumsum)

sal_min_max = f"Salary minimum:{company_df['Salary'].min()}, Salary maximum:{company_df['Salary'].max()}"
print(sal_min_max)

Salary minimum:10000, Salary maximum:20000

In [121]:
company_df['Date Started'] = ['06/12/1993', '01/06/1966','26/05/1964', '23/01/1968', '26/01/1976']
company_df

         Name       Job Title  Salary Date Started
0  John Smith       Reception   10000   06/12/1993
1    Jane Doe  Administration   12000   01/06/1966
2   Mike Mann         Manager   15000   26/05/1964
3  Mandy Mann        Director   20000   23/01/1968
4  Marge Mann        Director   20000   26/01/1976

In [122]:
inflation = 1.067
company_df['Salary'] = company_df['Salary'] * inflation

company_df['Pay After Bonus'] = company_df['Salary'] + 500
company_df['Salary'] = company_df['Salary'].astype('int')
company_df['Pay After Bonus'] = company_df['Pay After Bonus'].astype('int')
company_df

         Name       Job Title  Salary Date Started  Pay After Bonus
0  John Smith       Reception   10670   06/12/1993            11170
1    Jane Doe  Administration   12804   01/06/1966            13304
2   Mike Mann         Manager   16005   26/05/1964            16505
3  Mandy Mann        Director   21340   23/01/1968            21840
4  Marge Mann        Director   21340   26/01/1976            21840

In [123]:
#company_df['Date Started'] = pd.to_datetime(company_df['Date Started'], dayfirst=True)
company_df['Date Started'] = pd.to_datetime(company_df['Date Started'], format='%d/%m/%Y')
#company_df.dtypes
company_df

         Name       Job Title  Salary Date Started  Pay After Bonus
0  John Smith       Reception   10670   1993-12-06            11170
1    Jane Doe  Administration   12804   1966-06-01            13304
2   Mike Mann         Manager   16005   1964-05-26            16505
3  Mandy Mann        Director   21340   1968-01-23            21840
4  Marge Mann        Director   21340   1976-01-26            21840

In [128]:
company_df['DoB'] = ['06/12/1963', '01/06/1946','26/05/1934', '23/01/1928', '26/01/1956']
company_df['DoB'] = pd.to_datetime(company_df['DoB'], format='%d/%m/%Y')
company_df

         Name       Job Title  Salary Date Started  Pay After Bonus        DoB
0  John Smith       Reception   10670   1993-12-06            11170 1963-12-06
1    Jane Doe  Administration   12804   1966-06-01            13304 1946-06-01
2   Mike Mann         Manager   16005   1964-05-26            16505 1934-05-26
3  Mandy Mann        Director   21340   1968-01-23            21840 1928-01-23
4  Marge Mann        Director   21340   1976-01-26            21840 1956-01-26

In [137]:
company_df['Time Served'] = pd.to_datetime('16/11/2023', format='%d/%m/%Y') - company_df['Date Started']
company_df['Time Served'] = company_df['Time Served'] / pd.Timedelta('365 days')  #convert to years rather than default (days)
company_df['Time Served'] = company_df['Time Served'].round().astype('int', errors='ignore')   #round to full years
company_df

,Name,Job Title,Salary,Date Started,Pay After Bonus,DoB,Time Served
0,John Smith,Reception,10670,1993-12-06,11170,1963-12-06,30
1,Jane Doe,Administration,12804,1966-06-01,13304,1946-06-01,57
2,Mike Mann,Manager,16005,1964-05-26,16505,1934-05-26,60
3,Mandy Mann,Director,21340,1968-01-23,21840,1928-01-23,56
4,Marge Mann,Director,21340,1976-01-26,21840,1956-01-26,48